2ndshift.fresh-material
adpyke.codesnap
ajshort.include-autocomplete
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
dbaeumer.vscode-eslint
deerawan.vscode-faker
detachhead.basedpyright
dokca.42-ft-count-line
dooez.alt-catppuccin-vsc
eamodio.gitlens
edwinhuish.better-comments-next
esbenp.prettier-vscode
foxundermoon.shell-format
jgclark.vscode-todo-highlight
kevinrose.vsc-python-indent
kube.42header
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cpptools
ms-vscode.makefile-tools
njpwerner.autodocstring
njqdev.vscode-python-typehint
oderwat.indent-rainbow
perkovec.emoji
pulkitgangwar.nextjs-snippets
rust-lang.rust-analyzer
shoubhitjamadhiar.to-do-manager
tomoki1207.pdf
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscodevim.vim
xaver.clang-format
yoavbls.pretty-ts-errors
yzane.markdown-pdf
