accountsservice
adwaita-icon-theme
alacritty
alsa-firmware
alsa-plugins
alsa-utils
ani-cli
arc-gtk-theme-eos
aspell
aspell-fr
b43-fwcutter
base
base-devel
bash-completion
bat
bc
bear
bind
blueman
bluez
bluez-utils
brightnessctl
btrfs-progs
cantarell-fonts
chezmoi
clang
cliphist
cmake
code
code-features
code-marketplace
cryptsetup
cups
cups-browsed
cups-filters
cups-pdf
dconf-editor
device-mapper
diffutils
dmidecode
dmraid
dnsmasq
docker
dosfstools
downgrade
dracut
e2fsprogs
efibootmgr
efitools
endeavouros-branding
endeavouros-keyring
endeavouros-mirrorlist
eos-apps-info
eos-hooks
eos-log-tool
eos-packagelist
eos-qogir-icons
eos-quickstart
eos-rankmirrors
eos-settings-gnome
ethtool
evince
exfatprogs
eza
f2fs-tools
ffmpegthumbnailer
file-roller
firefox
firewalld
fprintd
fuzzel
fwupd
gdb
gdm
gimp
git
git-delta
glow
gnome-browser-connector
gnome-calculator
gnome-clocks
gnome-console
gnome-control-center
gnome-disk-utility
gnome-keyring
gnome-nettool
gnome-power-manager
gnome-screenshot
gnome-shell
gnome-system-monitor
gnome-terminal
gnome-text-editor
gnome-themes-extra
gnome-tweaks
gnome-usage
gnome-weather
gsimplecal
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-ugly
gvfs
gvfs-afc
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-smb
haveged
hdparm
hplip
hwdetect
hyprland
hyprpaper
inetutils
intel-ucode
iptables-nft
iwd
jdk21-openjdk
jfsutils
kernel-install-for-dracut
less
lf
libdvdcss
libfprint
libgsf
libopenraw
libqalculate
libwnck3
linux
linux-firmware
linux-headers
llvm
logrotate
loupe
lsb-release
lsscsi
luarocks
lvm2
man-db
man-pages
mdadm
mesa-utils
modemmanager
mtools
nano
nautilus
nemo
neovim
netctl
network-manager-applet
networkmanager
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
nilfs-utils
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
npm
nss-mdns
ntfs-3g
ntp
openssh
opera
pacman-contrib
paru
perl
pipewire-alsa
pipewire-jack
pipewire-pulse
pkgfile
plocate
poppler-glib
power-profiles-daemon
python
python-capng
python-click
python-ipykernel
python-pipx
python-pylint
python-pynvim
python-pyqt5
python-reportlab
rebuild-detector
reflector
reflector-simple
reiserfsprogs
rsync
rtkit
s-nail
seahorse
sg3_utils
smartmontools
snapd
sof-firmware
sudo
sushi
swayidle
swaylock-effects
sysfsutils
systemd-sysvcompat
texinfo
tk
tmux
trash-cli
tree
ts-node
ttf-bitstream-vera
ttf-dejavu
ttf-liberation
ttf-opensans
unrar
unzip
upower
usb_modeswitch
usbutils
valgrind
vim
waybar
welcome
wget
which
wireplumber
wireshark-qt
wl-clipboard
wpa_supplicant
xdg-desktop-portal
xdg-desktop-portal-gnome
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xf86-input-libinput
xfsprogs
xl2tpd
xorg-server
xorg-xdpyinfo
xorg-xinit
xorg-xinput
xorg-xkill
xorg-xrandr
xpdf
xterm
yarn
zoxide
zsh
